# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_certificate.vpn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_certificate" "vpn" {
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + certificate_policy              = (known after apply)
      + expires                         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub"
      + name                            = "VPNRootCert"
      + not_before                      = (known after apply)
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + tags                            = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)
    }

  # azurerm_key_vault_certificate.vpn will be updated in-place
  ~ resource "azurerm_key_vault_certificate" "vpn" {
        id                              = "https://kvaltinnauth001hub.vault.azure.net/certificates/VPNRootCert/dc43a0f1e5e549cf845744cc5085f007"
        name                            = "VPNRootCert"
        tags                            = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_account.storage will be updated in-place
  ~ resource "azurerm_storage_account" "storage" {
        id                                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Storage/storageAccounts/staltinnauth001hub"
        name                              = "staltinnauth001hub"
        tags                              = {
            "CreatedAt"   = "2025-01-10T15:03:03Z"
            "Environment" = "hub"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (41 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_virtual_network_gateway.vpn will be updated in-place
  ~ resource "azurerm_virtual_network_gateway" "vpn" {
        id                                    = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworkGateways/vpngwaltinnauth001hub"
        name                                  = "vpngwaltinnauth001hub"
        tags                                  = {}
        # (14 unchanged attributes hidden)

      ~ vpn_client_configuration {
            # (6 unchanged attributes hidden)

          - root_certificate {
              - name             = "VPNRootCert" -> null
              - public_cert_data = "MIIC/zCCAeegAwIBAgIQaMXHc91jah2sDZEnPxGgwjANBgkqhkiG9w0BAQsFADARMQ8wDQYDVQQDEwZWUE4gQ0EwHhcNMjUwMTEwMTgxODE4WhcNMzUwMTA4MTgxODE4WjARMQ8wDQYDVQQDEwZWUE4gQ0EwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDDoOdFiBM6I+HVF9tPGg0ZpaIVnQHuPoSIhgGAxx7EXPzCQq8uTLuzJbD/+dCZnz+dpmXM+LT4qSwaQ++YpXGdspIy53z0p3JQt2qMU5uye4r9TlML2NETw6wmDd0U6xgSRIuBwOIHPbm9ejrAf674n73iHhokmYmT75mYdT8ktydQw+L7R0MX23HLg3iQcWED3eZflj3X8Mqm8Z+UqEr2thkF2lJfiPeP/NKu7KOlWZHVrYPcVqVoSErLcvrCK/UKheOY7dGyt8f3PZp6CFXMDfo172l8pu39NZ/VGIXtNiSr03qLotzqaykBNkvM5uKp7uoPLykqjq72oYzBfrPhAgMBAAGjUzBRMA8GA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFB8OtSth0JBdv5yrXXLuRTFwRGDkMB8GA1UdIwQYMBaAFB8OtSth0JBdv5yrXXLuRTFwRGDkMA0GCSqGSIb3DQEBCwUAA4IBAQAfSym4y+4hlVtBeNdtJa60PzkZZ4YZ/a3YvDABf3xdv5M2xf8kL3kR6I1Wdv4lX+gRudcu8A5ECk+VbLE7/X1gutr7URO2cKEwGnxfvy1lF5KdUU0ai9lfKw2yKJxdchhcmvUoYiMG0vrmHQHL622zBGGO6MXRc81s8k+4kSd1tYqgfkGwfAGZ/vMEhc42dSaWMTsN07qp0So3wanLtcRsDyOCiRX84tF1DPC9BKMVwJZ/em7fizysIQjmp/IASfM4XJIUPfmHd9KxGDO3lyoULUm3FxsGZzxI+6hzk9gEC7WSuZzze9Xz+NUT49pmpiw9u/Jq9B8WHGMWelM3O3vM" -> null
            }
          + root_certificate {
              + name             = "VPNRootCert"
              + public_cert_data = (known after apply)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # pkcs12_from_pem.client_certs["andreasisnes"] will be updated in-place
  ~ resource "pkcs12_from_pem" "client_certs" {
        id              = "56ee545ac820831b60aef2280ec2477261f8dd90"
        # (5 unchanged attributes hidden)
    }

  # pkcs12_from_pem.client_certs["github"] will be updated in-place
  ~ resource "pkcs12_from_pem" "client_certs" {
        id              = "908669b2e21486d0f45bc07d2255731d08409cf0"
        # (5 unchanged attributes hidden)
    }

  # tls_private_key.client["andreasisnes"] will be updated in-place
  ~ resource "tls_private_key" "client" {
        id                            = "43cf1bad083f11566b5fff35ffbf83cd0cbee481"
        # (10 unchanged attributes hidden)
    }

  # tls_private_key.client["github"] will be updated in-place
  ~ resource "tls_private_key" "client" {
        id                            = "8e1e81c96e24d01b5568b6d13550179bf605db39"
        # (10 unchanged attributes hidden)
    }

  # tls_private_key.root will be updated in-place
  ~ resource "tls_private_key" "root" {
        id                            = "2167c7779cbff7fe4c7c5954da1f8fee03d4f952"
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`